package com.zheye.common.enums;

/**
 * @Auther: zhongqiuwu
 * @Date: 2018/6/8 16:27
 * @Description:错误状态码枚举
 */
public enum ErrorEnum {
	/**
	 * 命名规则：项目名大写加上错误码编号
	 * 	第一个参数为错误码编号（不能重复），第二个参数为错误详情
	 */
	SUCCESS_0(0000, "成功"),
	COMMON_0001(0001, "必传参数不能为空"),
	COMMON_0002(0002,"系统错误"),

	/**
	 * config
	 */
	CONFIG_1001(1001, "查询主配置为空"),
	CONFIG_1003(1003, "查询用户权益配置为空"),
	CONFIG_1004(1004, "查询用户升级配置为空"), 
	CONFIG_1005(1005, "查询所有配置为空"),
	CONFIG_1006(1006, "费率配置错误，范围：999999——0.0001"),
	
	/**
	 * trade
	 */
	TRADE_3000(3000, "访问其他服务异常"),
	TRADE_3001(3001, "参数异常"),
	TRADE_3002(3002,"success"),
	TRADE_3003(3003,"系统内部错误"),
	TRADE_3004(3004,"user_id不能为空"),
	TRADE_3005(3005,"token不能为空"),
	TRADE_3006(3006,"参数不能为空"),
	TRADE_3007(3007,"积分商城未开启"),
	TRADE_3008(3008,"未获取到数据"),
	TRADE_3009(3009,"redistool空了"),
	TRADE_3010(3010,"收货失败"),
	TRADE_3011(3011,"该订单号查询的数据为空，返积分失败"),
	TRADE_3012(3012,"返积分失败"),
	TRADE_3013(3013,"返积分成功，确认收货失败"),  
	TRADE_3014(3014,"根据店铺ID获取用户名称报空"),
	TRADE_3015(3015,"根据用户名称获取用户id失败"),
	TRADE_3016(3016,"根据用户手机获取用户id数据为空"),
	TRADE_3017(3017,"确认收货失败"),
	TRADE_3018(3018,"取消失败"),
	TRADE_3020(3020,"商品分类为空"),
	TRADE_3021(3021,"支付金额与订单金额不符"),
	TRADE_3022(3022,"支付密码错误"),
	TRADE_3023(3023,"余额不足"),
	TRADE_3024(3024,"未开通该支付方式"),
	TRADE_3025(3025,"不能购买自有商品"),
	TRADE_3026(3026,"积分不足"),
	TRADE_3027(3027,"库存不足"),
	TRADE_3028(3028,"该商品已下架"),

	/**
	 * user
	 */
	USER_4001(4001,"用户名或密码错误"),
	USER_4003(4003,"系统异常"),
	USER_4005(4005,"验证码已过期"),
	USER_4006(4006,"手机号不合法"),
	USER_4007(4007,"验证码错误"),
	USER_4008(4008,"用户已存在"),
	USER_4009(4009,"手机号未注册"),
	USER_4010(4010,"用户未注册"),
	USER_4011(4011,"两次密码不一致"),
	USER_4012(4012,"token为空"),
	USER_4013(4013,"token校验失败"),
	USER_4014(4014,"仅支持jpg、jpeg、png格式图片"),
	USER_4015(4015,"邮箱格式不正确"),
	USER_4016(4016,"邮件发送失败"),
	USER_4017(4017,"手机号未绑定"),
	USER_4019(4019,"用户注册失败"),
	USER_4020(4020,"手机号已被绑定"),
	USER_4021(4021,"密码不能包含中文"),
	USER_4022(4022,"密码不能有空格"),
	USER_4023(4023,"密码需包含字母"),
	USER_4024(4024,"密码长度6到32位"),
	USER_4025(4025,"原始密码输入错误"),
	USER_4026(4026,"认证中"),
	USER_4027(4027,"已认证"),
	USER_4028(4028,"身份证号与姓名不匹配"),
	USER_4029(4029,"请上传身份证正面照"),
	USER_4030(4030,"请上传身份证反面照"),
	USER_4031(4031,"请上传身份证半身手持照照片"),
	USER_4032(4032,"还未注册店铺"),
	USER_4033(4033,"非企业用户"),
	USER_4034(4034,"还未填写地址"),
	USER_4035(4035,"未实名认证"),
	USER_4036(4036,"银行卡已绑定"),
	USER_4040(4040,"您已经收藏过了"),
	USER_4037(4037,"验签失败"),
	USER_4038(4038,"余额不足"),
	USER_4039(4039,"银行卡认证失败，请检查提交信息是否正确"),
	USER_4041(4041,"不支持的支付方式"),
	USER_4042(4042,"店铺不存在"),
	USER_4043(4043,"获取主配置失败"),
	USER_4044(4044,"查询失败,请检测卡号是否正确"),
	USER_4045(4045,"dubbo服务注册失败"),
	/*USER_4046(4046,"密码必须包含字母"),
	USER_4047(4047,"密码不能包含中文"),
	USER_4048(4048,"密码不能包含空格"),
	USER_4049(4049,"密码长度6到32位字母加数字"),*/
	USER_4050(4050,"用户名不能包含特殊字符"),
	USER_4051(4051,"用户昵称不能包含特殊字符"),
	USER_4052(4052,"未进行企业认证"),
	USER_4053(4053,"企业认证失败，请检查提交数据是否正确"),
	USER_4054(4054,"邮箱已认证"),
	USER_4055(4055,"推荐人不存在"),
	USER_4058(4058,"无需再次购买升级产品"),
	USER_4056(4056,"姓名或身份证格式错误"),
	USER_4057(4057,"身份认证失败，请重新认证"),
	USER_4059(4059,"非常抱歉，只有企业账号才能进行商家入驻"),
	USER_4061(4061,"身份证已被另一账号绑定"),
	USER_4062(4062,"注册失败，请稍后重试"),
	USER_4063(4063,"网络错误，请稍后重试"),
	USER_4064(4064,"单次购买积分金额不能大于5000"),
	USER_4065(4065,"邮箱已被其他用户绑定"),
	USER_4066(4066,"用户名长度不能小于两位"),
	USER_4067(4067,"您设置的支付密码与原支付密码相同,请重新设置"),
	USER_4068(4068,"您设置的登录密码与原登录密码相同,请重新设置"),
	USER_4069(4069,"抱歉，暂不支持购买此升级产品"),
	USER_4070(4070,"抱歉，您不是企业用户或代理商"),
	USER_4071(4071,"银行卡已被另一账号绑定"),
	
	//Integral
	INTEGRAL_5001(5001, "查询主配置为空"),
	INTEGRAL_5004(5004, "传入封装订单数据为空"),
	INTEGRAL_5005(5005, "获取用户推荐关系失败"),
	INTEGRAL_5007(5007, "信息输入不完整"),
	INTEGRAL_5008(5008, "获取数据失败"),
	INTEGRAL_5009(5009, "初始化账户失败"),
	INTEGRAL_5010(5010, "操作失败"),
	INTEGRAL_5011(5011, "该用户账号已存在"),
	INTEGRAL_5012(5012, "系统异常"),
	INTEGRAL_5013(5013, "验证码已过期"),
	INTEGRAL_5014(5014, "验证码不正确"),
	INTEGRAL_5015(5015, "获取用户信息失败"),
	INTEGRAL_5016(5016, "库存积分不足"),
	INTEGRAL_5017(5017, "库存积分账户不存在"),
	INTEGRAL_5018(5018, "充值金额必须为整数"),
	INTEGRAL_5019(5019, "获取用户账户信息失败"),//dadasdasdasda
	INTEGRAL_5020(5020, "获取订单信息失败"),
	INTEGRAL_5022(5022, "团购车返积分参数不完整"),
	INTEGRAL_5023(5023, "用户积分账户异常"),
	INTEGRAL_5024(5024, "转账金额不能大于7位数"),
	INTEGRAL_5025(5025, "获赠人不能是自己"),
	INTEGRAL_5028(5027, "每次转赠数量不能大于50000"),
	INTEGRAL_5029(5029, "该用户不存在"),
	INTEGRAL_5030(5030, "获取线下商家店铺经营类目失败"),
	INTEGRAL_5031(5031, "该商家没有所属类目"),
	INTEGRAL_5032(5032, "不能给自己的账户报单"),
	INTEGRAL_5033(5033, "获取用户等级失败"),
	INTEGRAL_5034(5034, "获取配置失败"),
	
	


	//search
	SEARCH_6001(6001,"搜索错误"),
	SEARCH_6002(6002,"更新索引错误"),
	SEARCH_6003(6003,"搜索结果为空"),
	SEARCH_6004(6004,"添加索引失败"),
	SEARCH_6005(6005,"删除索引失败"),
	
	
	BUYCAR_7000(7000 , "参数错误"),
	BUYCAR_7001(7001 , "更改收益时间已过期"),
	BUYCAR_7002(7002 , "已出单不能更改收益类型"),
	BUYCAR_7003(7003 , "时间格式不正确"),
	BUYCAR_7004(7004 , "参数为空"),
	BUYCAR_7005(7005 , "根据银行卡号获取银行卡信息失败"),
	
	//system
	SYSTEM_10000(10000, "系统异常"),
	;


	

	private int errorCode;
	private String errorDesc;
	private ErrorEnum(int errorCode, String errorDesc) {
		this.errorCode = errorCode;
		this.errorDesc = errorDesc;
	}

	public int getErrorCode() {
		return errorCode;
	}

	public String getErrorDesc() {
		return errorDesc;
	}
	
}
